# CurtainSystemType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainSystem..::..CurtainSystemType Property
CurtainSystem Class See Also
---
get or set the type of the CurtainSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurtainSystemType CurtainSystemType { get; set; }
```

Visual Basic
---
```text
Public Property CurtainSystemType As CurtainSystemType
	Get
	Set
```

Visual C++
---
```text
public:
property CurtainSystemType^ CurtainSystemType {
	CurtainSystemType^ get ();
	void set (CurtainSystemType^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the specified parameter curtainSystemType is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the type of the CurtainSystem cannot be changed to the specified one. |

# See Also
CurtainSystem Class
Autodesk.Revit.DB Namespace